Tekla.Structures.Drawing.IPreferredPlacing
The IPreferredPlacing interface is for objects that can have different preferred placing types.

Tekla.Structures.Drawing.IPreferredPlacing.PreferredPlacing
The type of placing the object should use.
See Tekla.Structures.Drawing.PreferredPlacingTypes for different types of placing.